{"signal":{"depth":1,"original_time":"2022-11-28T15:55:19.687Z","reason":"event by root created low alert Windows Login Fail.","rule":{"author":["i.s."],"created_at":"2022-10-13T11:15:26.459Z","created_by":"ilias@lab.com","description":"Windows login fails","enabled":true,"false_positives":[],"from":"now-360s","id":"5695a830-4ae8-11ed-a487-0568a8cde037","immutable":false,"interval":"5m","license":"","max_signals":100,"name":"Windows Login Fail","references":[],"risk_score":30,"rule_id":"4886f407-a52e-4fbe-b5cf-54b3c0912b19","severity":"low","tags":["custom","bruteforce","auto_disabled_8.0"],"to":"now","type":"threshold","updated_at":"2022-11-28T15:35:37.747Z","updated_by":"ilias@lab.com","version":27},"status":"open","threshold_result":{"from":"2022-11-28T15:55:18.646Z","count":184}},"_id":"caede711c5070e0d6f829bc5e31404c627e684c91a9c773eb5d212f3ca72dead","_index":".internal.alerts-security.alerts-default-000004","kibana":{"version":"8.5.1","alert":{"rule":{"category":"Threshold Rule","consumer":"siem","execution":{"uuid":"744c9241-3b7d-4ece-87c3-cbff87047d76"},"name":"Windows Login Fail","producer":"siem","rule_type_id":"siem.thresholdRule","uuid":"5695a830-4ae8-11ed-a487-0568a8cde037","tags":["custom","bruteforce","auto_disabled_8.0"],"parameters":{"description":"Windows login fails","risk_score":30,"severity":"low","license":"","meta":{"from":"1m","kibana_siem_app_url":"https://siem.local/app/security"},"author":["i.s."],"false_positives":[],"from":"now-360s","rule_id":"4886f407-a52e-4fbe-b5cf-54b3c0912b19","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"reference":"https://attack.mitre.org/tactics/TA0043","name":"Reconnaissance","id":"TA0043"},"technique":[]}],"to":"now","references":[],"version":27,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"winlogbeat-*","query":"winlog.event_id : \"4625\" AND NOT user.name: \"QvService\" ","filters":[],"threshold":{"field":["user.name"],"value":50,"cardinality":[]}},"actions":[{"group":"default","id":"06b16af0-6cbe-11ed-9fd9-b5d8b4b2c157","params":{"message":"{{#context.alerts}}{{.}}{{/context.alerts}}","to":["ilias@lab.com"],"subject":"test"},"action_type_id":".email"}],"author":["i.s."],"created_at":"2022-10-13T11:15:26.459Z","created_by":"ilias@lab.com","description":"Windows login fails","enabled":true,"exceptions_list":[],"false_positives":[],"from":"now-360s","immutable":false,"interval":"5m","indices":["winlogbeat-*"],"license":"","max_signals":100,"references":[],"risk_score_mapping":[],"rule_id":"4886f407-a52e-4fbe-b5cf-54b3c0912b19","severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"reference":"https://attack.mitre.org/tactics/TA0043","name":"Reconnaissance","id":"TA0043"},"technique":[]}],"to":"now","type":"threshold","updated_at":"2022-11-28T15:35:37.747Z","updated_by":"ilias@lab.com","version":27,"meta":{"from":"1m","kibana_siem_app_url":"https://siem.local/app/security"},"risk_score":30,"severity":"low"},"original_time":"2022-11-28T15:55:19.687Z","ancestors":[{"id":"b14839d2-0697-5bf5-9e4d-3727605e97de","type":"event","index":"winlogbeat-*","depth":0}],"status":"active","workflow_status":"open","depth":1,"reason":"event by root created low alert Windows Login Fail.","severity":"low","risk_score":30,"uuid":"caede711c5070e0d6f829bc5e31404c627e684c91a9c773eb5d212f3ca72dead","threshold_result":{"count":184,"from":"2022-11-28T15:55:18.646Z","terms":[{"field":"user.name","value":"root"}]}},"space_ids":["default"]},"@timestamp":"2022-11-28T15:59:33.905Z","user":{"name":"root"},"event":{"kind":"signal"}}
